// Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).

Console.Clear();

Console.WriteLine("Введите число: ");
int number = nt.Parse(Console.ReadLine()!);i

if(number % 2 == 0);
{
    Console.WriteLine($"Число {number} чётное");
}

else 
{
    Console.WriteLine($"Число {number} не чётное");
}